![dev1.jpg](imgs/dev1.jpg)

# **Exerc√≠cios de Pandas üêº‚ú®**

## **Lista de Exerc√≠cio 7 - Pandas II**
### Fala devs, blz? 

Essa √© a nossa 7¬™ lista de exerc√≠cios, parab√©ns por ter chegado at√© aqui! üöÄ

Dessa vez, iremos fixar os conceitos aprendidos na segunda aula da biblioteca Pandas! Os exerc√≠cios a seguir abordam fun√ß√µes como `apply`, trabalhar com datas, agrupamentos e combina√ß√µes de tabelas. Bora l√°?

## üöÄ Exerc√≠cio 1: Trabalhando com `apply` e `apply(lambda)`

### O que voc√™ vai fazer:
1. Crie um DataFrame com as seguintes colunas: Nome, Idade, Cidade e Sal√°rio.
   ```plaintext
   Nome: Antonio, Bernardo, Carolina, Diego
   Idade: 25, 30, 35, 28
   Cidade: S√£o Paulo, Rio de Janeiro, Belo Horizonte, S√£o Paulo
   Sal√°rio: 3500, 4200, 3700, 3100
   ```
2. Adicione uma nova coluna **"Faixa_Etaria"**:
   * Se a idade for menor que 30, escreva "Jovem".
   * Se estiver entre 30 e 40 (inclusive), escreva "Adulto".
   * Use ```apply``` ou ```apply(lambda)``` para fazer isso!

3. Aplique um aumento de 10% no sal√°rio e atualize os valores da coluna ```Sal√°rio```

Dica: d√° pra usar ```apply(lamda)``` pra isso tamb√©m!

In [26]:
import pandas as pd

In [27]:
# --- Exerc√≠cio 1 ---
# Criando o DataFrame inicial
df = pd.DataFrame({
    'Nome': ['Jo√£o', 'Maria', 'Pedro', 'Ana'],
    'Idade': [25, 30, 35, 28],
    'Cidade': ['S√£o Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'S√£o Paulo'],
    'Sal√°rio': [3500, 4200, 3700, 3100]
})

# 1. Criando a coluna Faixa_Et√°ria
df['Faixa_Et√°ria'] = df['Idade'].apply(lambda x: 'Jovem' if x < 30 else 'Adulto')

# 2. Aumentando os sal√°rios em 10%
df['Sal√°rio'] = df['Sal√°rio'].apply(lambda x: x * 1.1)

In [28]:
df

    Nome  Idade          Cidade  Sal√°rio Faixa_Et√°ria
0   Jo√£o     25       S√£o Paulo   3850.0        Jovem
1  Maria     30  Rio de Janeiro   4620.0       Adulto
2  Pedro     35  Belo Horizonte   4070.0       Adulto
3    Ana     28       S√£o Paulo   3410.0        Jovem

## üóìÔ∏è **Exerc√≠cio 2: Datas no Pandas**

### O que voc√™ vai fazer:
1. Crie um DataFrame com duas colunas: Nome e Data_Nascimento.
   ```plaintext
   Nome: Antonio, Bernardo, Carolina, Diego
   Data_Nascimento: 1998-06-15, 1993-09-21, 1988-11-03, 1995-03-12
   ```
2. Converta a coluna `Data_Nascimento` para o formato de **datas do Pandas** usando `pd.to_datetime`.  
3. Extraia o **ano de nascimento** e crie uma nova coluna chamada `Ano_Nascimento`.  
4. Crie mais uma coluna chamada `Mes_Dia` que contenha apenas o m√™s e o dia, no formato `MM-DD`.  

Dica: Para formatar datas, voc√™ pode usar `.strftime`.

In [29]:
# --- Exerc√≠cio 2 ---
# Criando o DataFrame inicial
df_datas = pd.DataFrame({
    'Nome': ['Jo√£o', 'Maria', 'Pedro', 'Ana'],
    'Data_Nascimento': ['1998-06-15', '1993-09-21', '1988-11-03', '1995-03-12']
})

# 1. Convertendo a coluna Data_Nascimento para datetime
df_datas['Data_Nascimento'] = pd.to_datetime(df_datas['Data_Nascimento'])

# 2. Criando a coluna Ano_Nascimento
df_datas['Ano_Nascimento'] = df_datas['Data_Nascimento'].dt.year

# 3. Criando a coluna Mes_Dia com formato MM-DD
df_datas['Mes_Dia'] = df_datas['Data_Nascimento'].dt.strftime('%m-%d')

In [30]:
df_datas

    Nome Data_Nascimento  Ano_Nascimento Mes_Dia
0   Jo√£o      1998-06-15            1998   06-15
1  Maria      1993-09-21            1993   09-21
2  Pedro      1988-11-03            1988   11-03
3    Ana      1995-03-12            1995   03-12

## üìä **Exerc√≠cio 3: Agrupamentos e Pivot Tables**

### O que voc√™ vai fazer:
1. Crie um DataFrame com dados de vendas:
   ```plaintext
   Produto: Produto1, Produto2, Produto3, Produto4, Produto5, Produto6
   Categoria: A, B, A, B, A, B
   Valor: 500, 700, 200, 400, 800, 300
   Vendedor: Antonio, Bernardo, Antonio, Diego, Carolina, Bernardo
   M√™s: Janeiro, Janeiro, Fevereiro, Fevereiro, Janeiro, Fevereiro
   ```
2. Use o `groupby` para somar os valores (`Valor`) por **Categoria**.
3. Crie uma tabela din√¢mica (usando `pivot_table`) que mostre as vendas totais por **M√™s** e **Vendedor**.

Dica: N√£o se preocupe com valores faltantes, o `pivot_table` pode lidar com isso facilmente usando `fill_value=0`.

In [31]:
# --- Exerc√≠cio 3 ---
# Criando o DataFrame inicial
vendas = pd.DataFrame({
    'Produto': ['Produto1', 'Produto2', 'Produto3', 'Produto4', 'Produto5', 'Produto6'],
    'Categoria': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Valor': [500, 700, 200, 400, 800, 300],
    'Vendedor': ['Jo√£o', 'Maria', 'Jo√£o', 'Ana', 'Pedro', 'Maria'],
    'M√™s': ['Janeiro', 'Janeiro', 'Fevereiro', 'Fevereiro', 'Janeiro', 'Fevereiro']
})

# 1. Total de vendas por Categoria usando groupby
vendas_por_categoria = vendas.groupby('Categoria')['Valor'].sum()

# 2. Tabela din√¢mica com total de vendas por M√™s e Vendedor
pivot_vendas = vendas.pivot_table(values='Valor', index='M√™s', columns='Vendedor', aggfunc='sum', fill_value=0)

In [32]:
pivot_vendas

Vendedor   Ana  Jo√£o  Maria  Pedro
M√™s
Fevereiro  400   200    300      0
Janeiro      0   500    700    800

## üîó **Exerc√≠cio 4: Juntando tabelas com `merge`**

### O que voc√™ vai fazer:
1. Crie dois DataFrames:
   - **Clientes**:
     ```plaintext
     ClienteID: 1, 2, 3
     Nome: Antonio, Bernardo, Diego
     Cidade: S√£o Paulo, Rio de Janeiro, Belo Horizonte
     ```
   - **Compras**:
     ```plaintext
     CompraID: 101, 102, 103, 104
     ClienteID: 1, 2, 3, 1
     Produto: Produto1, Produto2, Produto3, Produto4
     Valor: 500, 700, 300, 400
     ```
2. Combine essas tabelas usando `merge` para ligar os clientes √†s suas compras, com base no campo `ClienteID`.
3. Calcule o total gasto por cada cliente e crie uma tabela com o nome do cliente e o valor total.

In [35]:
# --- Exerc√≠cio 4 ---
# Criando os DataFrames iniciais
clientes = pd.DataFrame({
    'ClienteID': [1, 2, 3],
    'Nome': ['Jo√£o', 'Maria', 'Ana'],
    'Cidade': ['S√£o Paulo', 'Rio de Janeiro', 'Belo Horizonte']
})

compras = pd.DataFrame({
    'CompraID': [101, 102, 103, 104],
    'ClienteID': [1, 2, 3, 1],
    'Produto': ['Produto1', 'Produto2', 'Produto3', 'Produto4'],
    'Valor': [500, 700, 300, 400]
})

# 1. Juntando os DataFrames com base em ClienteID
clientes_compras = pd.merge(clientes, compras, on='ClienteID', how='inner')

# 2. Calculando o total gasto por cliente
total_gasto_por_cliente = clientes_compras.groupby('Nome')['Valor'].sum()

display(df, df_datas, vendas_por_categoria, pivot_vendas, clientes_compras, total_gasto_por_cliente)
# observa√ß√£o: o display() √© utilizado para exibir m√∫ltiplos DataFrames em uma √∫nica c√©lula, mas n√£o √© necess√°rio para o c√≥digo funcionar

    Nome  Idade          Cidade  Sal√°rio Faixa_Et√°ria
0   Jo√£o     25       S√£o Paulo   3850.0        Jovem
1  Maria     30  Rio de Janeiro   4620.0       Adulto
2  Pedro     35  Belo Horizonte   4070.0       Adulto
3    Ana     28       S√£o Paulo   3410.0        Jovem

    Nome Data_Nascimento  Ano_Nascimento Mes_Dia
0   Jo√£o      1998-06-15            1998   06-15
1  Maria      1993-09-21            1993   09-21
2  Pedro      1988-11-03            1988   11-03
3    Ana      1995-03-12            1995   03-12

Categoria
A    1500
B    1400
Name: Valor, dtype: int64

Vendedor   Ana  Jo√£o  Maria  Pedro
M√™s
Fevereiro  400   200    300      0
Janeiro      0   500    700    800

   ClienteID   Nome          Cidade  CompraID   Produto  Valor
0          1   Jo√£o       S√£o Paulo       101  Produto1    500
1          1   Jo√£o       S√£o Paulo       104  Produto4    400
2          2  Maria  Rio de Janeiro       102  Produto2    700
3          3    Ana  Belo Horizonte       103  Produto3    300

Nome
Ana      300
Jo√£o     900
Maria    700
Name: Valor, dtype: int64

# **Desafio: üîí Gerador de Senhas Personalizadas**

Voc√™ est√° criando um sistema que gera senhas personalizadas para os usu√°rios com base em suas informa√ß√µes pessoais. As senhas precisam ser √∫nicas e seguras, mas tamb√©m f√°ceis de lembrar.

1. **Crie um programa que pe√ßa ao usu√°rio seu nome e uma data**. O programa deve gerar uma senha usando a seguinte l√≥gica:
   - As 3 primeiras letras do nome.
   - Os dois primeiros d√≠gitos do ano.
   - O n√∫mero de caracteres do nome completo (incluindo espa√ßos).

   **Exemplo**: Para um usu√°rio chamado "Diego Beatriz Costa" e "15/08/1990", a senha seria: `Diego19 18`.

2. **Modifique o programa para transformar as letras da senha gerada em letras mai√∫sculas e adicionar um caractere especial "!" no final da senha**.

   **Exemplo modificado**: A senha final seria: `Diego19 18!`.

In [34]:
# --- Desafio ---
# Fun√ß√£o para criar a senha personalizada
def gerar_senha():
    # Solicitar as informa√ß√µes do usu√°rio
    nome = input("Digite seu nome completo: ")
    data = input("Digite uma data no formato DD/MM/AAAA: ")
    
    # Processar as informa√ß√µes
    tres_letras = nome[:3]  # As 3 primeiras letras do nome
    ano = data.split("/")[-1]  # Extrair o ano da data
    dois_digitos_ano = ano[:2]  # Pegar os dois primeiros d√≠gitos do ano
    num_caracteres = len(nome)  # N√∫mero de caracteres no nome completo (incluindo espa√ßos)
    
    # Montar a senha inicial
    senha_inicial = f"{tres_letras}{dois_digitos_ano}{num_caracteres}"
    
    # Transformar em mai√∫sculas e adicionar caractere especial
    senha_final = senha_inicial.upper() + "!"
    
    return senha_final

# Testando a fun√ß√£o
senha_gerada = gerar_senha()
senha_gerada

'0!'